Documents/бит_УстановкаСтавокПоУслугам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_УстановкаСтавокПоУслугам</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бит_СтавкиНаУслуги</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмеетЛьготнуюСтавку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПоставщикиУслуг</v8:Type>
						<v8:Type>cfg:CatalogRef.бит_ТарифныеГруппыПоставщиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СтавкиНаУслуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛьготнаяСтавка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НормативПотребленияПоКу</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсновнаяСтавка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлановаяСтавка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ПоставщикиУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РежимПотребления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_РежимыПотребленияУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СверхНормативнаяСтавка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособРасчета</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_СпособыРасчетаПоУслугам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусКвартиры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СтатусыКвартиры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусЛицевогоСчета</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_СтатусыЛицевыхСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тариф</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипКвартиры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ТипыКвартиры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/бит_СтавкиНаУслуги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_СтавкиНаУслуги</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПлановаяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнаяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СверхНормативнаяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛьготнаяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РежимПотребления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_РежимыПотребленияУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПоставщикиУслуг</v8:Type>
						<v8:Type>cfg:CatalogRef.бит_ТарифныеГруппыПоставщиков</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СпособРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СпособыРасчетаПоУслугам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусКвартиры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусыКвартиры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыКвартиры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/бит_УстановкаСтавокПоУслугам/Ext/ObjectModule.bsl
#Область ПеременныеМодуля

Перем мВалютаРегламентированногоУчета Экспорт; // Хранит валюту регламентированного учета.

#КонецОбласти

#Область ЭкспортныеПроцедурыИФункцииДокумента

#Если Клиент Тогда
	
// Процедура осуществляет печать документа. Можно направить печать на. 
// Экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// По переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
		
	// Получить экземпляр документа на печать.
	Если ИмяМакета = "" Тогда
		ТабДокумент = "";
	КонецЕсли;
		
КонецПроцедуры
	
#КонецЕсли

// Возвращает доступные варианты печати документа.
//
// Возвращаемое значение:
//  Структура, каждая строка которой соответствует одному из вариантов печати.
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура();
	
КонецФункции

#КонецОбласти

#Область ОбеспечениеПроведенияДокумента

// Процедура выполняет проверку заполнения шапки и таб. частей.
//
// Параметры:
// Отказ - булево.
// Заголовок  – Строка.
Процедура ПроверкаРеквизитов(Отказ,Заголовок)
	
	// Проверим заполнение шапки.
	СтруктураОбязательныхПолей = Новый Структура;
	СтруктураОбязательныхПолей.Вставить("Организация");
	СтруктураОбязательныхПолей.Вставить("Услуга");
	// СтруктураОбязательныхПолей.Вставить("Поставщик");.
	
	бит_ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект,  СтруктураОбязательныхПолей,   Отказ, Заголовок);
	
КонецПроцедуры

// Проверяет правильность заполнения строк табличной части "СтавкиНаУслуги".
//
// Параметры: 
//  ТаблицаСтавок - результат запроса, содержащий данные для проведения и проверки ТЧ СтавкиНаУслуги.
//  СтруктураШапкиДокумента   - структура, содержащая рексвизиты шапки документа и результаты запроса по шапке.
//  Отказ                     - флаг отказа в проведении.
//  Заголовок                 - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиСтавкиНаУслуги(ТаблицаСтавок, СтруктураШапкиДокумента, Отказ, Заголовок)
	
	ИмяТабличнойЧасти = "СтавкиНаУслуги";
	
	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура("РежимПотребления,Поставщик,СпособРасчета,СтатусКвартиры,ТипКвартиры");
	
	// Теперь вызовем общую процедуру проверки.
	бит_ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "СтавкиНаУслуги", СтруктураОбязательныхПолей, Отказ, Заголовок);
	
КонецПроцедуры

// Выгружает результат запроса в табличную часть, добавляет ей необходимые колонки для проведения.
//
// Параметры: 
//  РезультатЗапросаПоТоварам - результат запроса по табличной части "СтавкиНаУслуги",
//  СтруктураШапкиДокумента   - структура, содержащая рексвизиты шапки документа и результаты запроса по шапке.
//
// Возвращаемое значение:
//  Сформированная таблиица значений.
//
Функция ПодготовитьТаблицуСтавок(РезультатЗапросаПоСтавкам, СтруктураШапкиДокумента)
	
	ТаблицаСтавок = РезультатЗапросаПоСтавкам.Выгрузить();
	
	Возврат ТаблицаСтавок;
	
КонецФункции

// Процедура выполняет заполнение таблицу ставок.
//
Процедура ПодготовитьТаблицыДокумента(СтруктураШапкиДокумента, ТаблицаСтавок) Экспорт
	
	// Получим необходимые данные для проведения и проверки заполенения данные по табличной части "СтавкиНаУслуги".
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("РежимПотребления"	     , "РежимПотребления");
	СтруктураПолей.Вставить("СтатусЛицевогоСчета"    , "СтатусЛицевогоСчета");
	СтруктураПолей.Вставить("СпособРасчета"          , "СпособРасчета");
	СтруктураПолей.Вставить("СтатусКвартиры"   	     , "СтатусКвартиры");
	СтруктураПолей.Вставить("ТипКвартиры"            , "ТипКвартиры");
	СтруктураПолей.Вставить("ПлановаяСтавка"         , "ПлановаяСтавка");
	СтруктураПолей.Вставить("ОсновнаяСтавка"	     , "ОсновнаяСтавка");
	СтруктураПолей.Вставить("СверхНормативнаяСтавка" , "СверхНормативнаяСтавка");
	СтруктураПолей.Вставить("Поставщик"	             , "Поставщик");
	СтруктураПолей.Вставить("Тариф"	            	 , "Тариф");
	СтруктураПолей.Вставить("ЛьготнаяСтавка"	     , "ЛьготнаяСтавка");
	
	РезультатЗапросаПоСтавкам = бит_ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "СтавкиНаУслуги", СтруктураПолей);
	
	// Подготовим таблицы товаров для проведения.
	ТаблицаСтавок      = ПодготовитьТаблицуСтавок(РезультатЗапросаПоСтавкам, СтруктураШапкиДокумента);
	
КонецПроцедуры	

// Процедура выполняет движения по регистрам.
//                
Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента,ТаблицаСтавок,Отказ,Заголовок)
	
	// Движения по регистру бит_СтавкиНаУслуги.
	
	НаборЗаписей = Движения.бит_СтавкиНаУслуги; 
	
	Для Каждого ТекСтрока Из ТаблицаСтавок Цикл
		СтрокаДвижений = НаборЗаписей.Добавить();
		СтрокаДвижений.Период 			      = СтруктураШапкиДокумента.Дата;
		СтрокаДвижений.Услуга 			      = СтруктураШапкиДокумента.Услуга;
		СтрокаДвижений.Поставщик 		      = ТекСтрока.Поставщик;
		СтрокаДвижений.ОсновнаяСтавка 	      = ТекСтрока.ОсновнаяСтавка;
		СтрокаДвижений.ПлановаяСтавка 	      = ТекСтрока.ПлановаяСтавка;
		СтрокаДвижений.РежимПотребления       = ТекСтрока.РежимПотребления;
		СтрокаДвижений.СверхНормативнаяСтавка = ТекСтрока.СверхНормативнаяСтавка;
		СтрокаДвижений.СпособРасчета 	      = ТекСтрока.СпособРасчета;
		СтрокаДвижений.СтатусКвартиры		  = ТекСтрока.СтатусКвартиры;
		СтрокаДвижений.ТипКвартиры 			  = ТекСтрока.ТипКвартиры;
		СтрокаДвижений.Тариф                  = ТекСтрока.Тариф;
		СтрокаДвижений.ЛьготнаяСтавка	  = ТекСтрока.ЛьготнаяСтавка;
	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Перем ТаблицаСтавок; // Хранит таблицу ставок.
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = бит_ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	// Проверка ручной корректировки.
	Если бит_ОбщегоНазначения.РучнаяКорректировкаОбработкаПроведения(РучнаяКорректировка,Отказ,Заголовок,ЭтотОбъект) Тогда
		Возврат
	КонецЕсли;
	
	ПроверкаРеквизитов(Отказ,Заголовок);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	СтруктураШапкиДокумента = бит_ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	ПодготовитьТаблицыДокумента(СтруктураШапкиДокумента, ТаблицаСтавок);
	
	ПроверитьЗаполнениеТабличнойЧастиСтавкиНаУслуги(ТаблицаСтавок, СтруктураШапкиДокумента, Отказ, Заголовок);
	
	// Выполним движения.
	Если НЕ Отказ Тогда
		ДвиженияПоРегистрам(СтруктураШапкиДокумента,ТаблицаСтавок,Отказ,Заголовок);
	КонецЕсли; 
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	бит_ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ, РучнаяКорректировка, Ложь);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	бит_ОбщегоНазначения.ПередЗаписьюДокументаДляУдаленияДвиженийПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	// Заполнить реквизиты значениями по умолчанию.
	бит_ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект ,бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));
	
КонецПроцедуры

#КонецОбласти

#Область ОператорыОсновнойПрограммы

мВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();

#КонецОбласти
